src/cf/InformationRegisters/РеестрЗадачПоИсполнителям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗадачПоИсполнителям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПриложения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСостоянияУчастниковЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьЗамещающие</Name>
					<Comment>Признак наличия замещающих по действию для отбора в списке задач</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПодзадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запланировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Истекает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПереносовСроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрокОбщий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПоступившихОбновлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилиОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченоИОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПриложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МожетБытьПросрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/ЦППК_ФормаГрупповойОбработкиРезультатаДействия/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Исполнитель = Сотрудники.ОсновнойСотрудник();
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	КонецЕсли;
	
	ВидДействия = Справочники.ВидыДействийЗадач.ОбработатьРезультат;
	ВидЗадачи = Справочники.ВидыЗадач.ЗапросНаПереносСрока;
	РезультатВыполнения = Справочники.РезультатыДействийЗадач.ЗакрытЗапрос;
	
	Если НЕ ЗначениеЗаполнено(СодержитТекст) Тогда
		СодержитТекст = "Ознакомиться: перенос срока по задаче";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобратьПослеИзмененияОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Запись_ПоступившиеОбновленияЗадач");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОтобратьПослеИзмененияОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)
	ОтобратьПослеИзмененияОтбора();
КонецПроцедуры

&НаКлиенте
Процедура СодержитТекстПриИзменении(Элемент)
	ОтобратьПослеИзмененияОтбора();
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыполненияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РезультатВыполнения) Тогда
		ОбновитьРезультатПослеОтбора();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для каждого СтрокаДействияЗадач Из ДействияЗадач Цикл
		СтрокаДействияЗадач.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьОтметки(Команда)

	Для каждого СтрокаДействияЗадач Из ДействияЗадач Цикл
		СтрокаДействияЗадач.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подобрать(Команда)
	ОтобратьПослеИзмененияОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если НЕ ЗначениеЗаполнено(РезультатВыполнения) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать результат выполнения действия задачи.'"));
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаОтметки Из ДействияЗадач Цикл
		
		Если НЕ СтрокаОтметки.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ДанныеВыполнения = ВыполнитьДействиеНаСервере(СтрокаОтметки.ДействиеЗадачи, РезультатВыполнения);
			СтрокаОтметки.Результат = ДанныеВыполнения.ПредставлениеРезультата;
			СтрокаОтметки.Пометка = Ложь;
			
		Исключение
			СтрокаОтметки.Результат = ОписаниеОшибки();
		КонецПопытки;
	
	КонецЦикла;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Обработка завершена.'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьотОбражениеГруппыВыполнения()
	
	Элементы.ГруппаВыполнение.Доступность = ДействияЗадач.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоступныеДействия()
	
	Элементы.РезультатВыполнения.СписокВыбора.Очистить();
	
	Если ДействияЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеЗадачи = ДействияЗадач[0].ДействиеЗадачи;
	РезультатыВариантовВыполнения = РезультатыВариантовВыполнения(ДействиеЗадачи, ВидДействия, ВидЗадачи);
	
	МассивДоступныхДействий = Новый Массив;
	
	Для каждого СтрокаРезультатыВариантовВыполнения Из РезультатыВариантовВыполнения Цикл
		МассивДоступныхДействий.Добавить(СтрокаРезультатыВариантовВыполнения.Значение);
	КонецЦикла;
	
	Если МассивДоступныхДействий.Найти(РезультатВыполнения) = Неопределено Тогда
		РезультатВыполнения = ПредопределенноеЗначение("Справочник.РезультатыДействийЗадач.ПустаяСсылка");
	КонецЕсли;
	
	Для каждого ЗначениеДоступныхДействий Из МассивДоступныхДействий Цикл
		Элементы.РезультатВыполнения.СписокВыбора.Добавить(ЗначениеДоступныхДействий);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатыВариантовВыполнения(ДействиеЗадачи, ВидДействия, ВидЗадачи)

	Возврат РаботаСЗадачами.РезультатыВариантовВыполнения(
	ДействиеЗадачи,
	ВидЗадачи,
	ВидДействия);

КонецФункции

&НаКлиенте
Процедура ОбновитьРезультатПослеОтбора()
	
	ПредставлениеРезультата = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(
	РезультатВыполнения, "ЗаголовокКоманды");
	
	Для каждого СтрокаДействияЗадач Из ДействияЗадач Цикл
	
		СтрокаДействияЗадач.Результат = 
		СтрШаблон(НСтр("ru = 'Будет выполнено:
                                             |%1'"),
		ПредставлениеРезультата);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПослеИзмененияОтбора()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПодобратьНаСервере();
	ОбновитьРезультатПослеОтбора();
	ЗаполнитьДоступныеДействия();
	ОбновитьотОбражениеГруппыВыполнения();
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНаСервере()
	
	ДействияЗадач.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Пометка,
	|	ДействияЗадач.ДействиеЗадачи КАК ДействиеЗадачи,
	|	ДействияЗадач.ВидЗадачи КАК ВидЗадачи,	
	|	ДействияЗадач.Дата КАК Создана
	|ИЗ
	|	РегистрСведений.РеестрЗадачПоИсполнителям КАК ДействияЗадач
	|ГДЕ
	|	ДействияЗадач.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДействияЗадач.Исполнитель = &Исполнитель
	|	И ДействияЗадач.ВидДействия = &ВидДействия
	|	И НЕ ДействияЗадач.Выполнено
	|	И ДействияЗадач.СостояниеУчастникаЗадачи = &СостояниеУчастниковЗадач
	|	И ДействияЗадач.ДействиеЗадачи.ОсобоеОписание ПОДОБНО &СодержитТекст
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДействияЗадач.Дата";
	
	Запрос.УстановитьПараметр("ВидДействия", ВидДействия);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("СодержитТекст", СодержитТекст + "%");
	Запрос.УстановитьПараметр("СостояниеУчастниковЗадач", Справочники.СостоянияУчастниковЗадач.Новая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ДействияЗадач.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьДействиеНаСервере(ДействиеЗадачи, РезультатВыполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЗадачи = Новый Массив;
	МассивЗадачи.Добавить(ДействиеЗадачи);
	
	ПараметрыВыполнения = РаботаСЗадачамиКлиентСервер.НовыйПараметрыВыполненияДействийЗадач();
	
	ДанныеВыполнения = РаботаСЗадачамиВызовСервера.ВыполнитьДействиеЗадачи(МассивЗадачи,
	РезультатВыполнения,
	ПараметрыВыполнения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеВыполнения;
	
КонецФункции

#КонецОбласти
